package Task2.Seminal1.lesson2;
/*Интерфейс ActorBehavoir, который будет содержать описание возможных действий актора в очереди/магазине
Абстрактный класс Actor, который хранит в себе параметры актора, включая состояние готовности сделать заказ и факт получения заказа.

20:39
Дополнение: для большего понимания, можно сделать методы-геттеры для имени и прочих “персональных данных” abstract
3.         Класс Human, который должен наследоваться от Actor и реализовывать ActorBehavoir

20:39
Интерфейс QueueBehaviour, который описывает логику очереди – помещение в/освобождение из очереди, принятие/отдача заказа
Интерфейс MarketBehaviour, который описывает логику магазина – приход/уход покупателей, обновление состояния магазина
Класс Market, который реализовывает два вышеуказанных интерфейса и хранит в списке список людей в очереди в различных статусах*/
public class Main {
    public static void main(String[] args) {


    }
}
